# Lock Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGridLine..::..Lock Property
CurtainGridLine Class See Also
---
Retrieves or changes the lock state of the curtain grid line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Lock { get; set; }
```

Visual Basic
---
```text
Public Property Lock As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Lock {
	bool get ();
	void set (bool value);
}
```

# See Also
CurtainGridLine Class
Autodesk.Revit.DB Namespace